print("HelloWorld")
#a是变量名,=为赋值符.字符串有四种表示方式'我'  "你" '''我''' """我"""
a=1223

print(type(a))
b="sigeidesi"
print(type(b))
#[]list,表示一个列表可存多个数据,用逗号隔开
c=[1,2,5,6]
print(type(c))
#()tuple,表示一个元组可存多个数据,用逗号隔开
d=(1,23,4)
print(type(d))
f="1"
print(type(f))
#{}dict表示字典,可以存多个键值对数据,用逗号隔开,key和value用冒号隔开.
e={"姓名":"崔七号","手机号":"18956388271","性别":"男"}
print(type(e))
print(e)
#1
w=["张三","李四","王五","赵六","前妻"]
print(w)
#2
q={"姓名":"张三","年龄":"18","性别":"女","科目":"语文","成绩":"80"}
print(q)
#3
z=("A",2,3,4,5,6,7,8,9,"J","Q","K")
print(z)
#4
h=1000
print(h)
#5
l="学生"
print(l)
# 小明有20块钱，红双喜10块钱，玉溪25块钱，大前门5块钱   求出小明可以买那种烟
a=10
b=25
c=5
if(a<=20):
    print("红双喜")
if(b<=20):
    print("玉溪")
if(c<=20):
    print("大前门")
# -----------------------------------------------------------------
x=20
if(x>=10):
    print(x,"元可以买红双喜")
if(x>=25):
    print(x,"元可以买玉溪")
if(x>=5):
    print(x,"元可以买大前门")
# --------------------------------------------------------------------
#成人票 200 18岁以下未成年票100 60岁以上的老人票 150 小明今年18岁，去买票应该买那种票？
a=99999999999
if(a<18):
    print('小明花100去买未成年票')
elif(a>=18 and a<=60):
    print("小明花200去买成人票")
elif(a>60):
    print("小明花150去买老人票")




